In [57]:
#make the jupyter cell take the entire screen
#https://stackoverflow.com/q/21971449/8782077
#https://stackoverflow.com/q/21971449/8782077
#write the following in cmd
#jt -t oceans16 -f roboto -fs 12 -cellw 100%^X

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01  0.377345 -0.361995 -0.435511  0.396943
2013-01-02 -0.326366 -0.722232 -0.006509  0.606142
2013-01-03  1.070022 -0.189074  0.587391 -1.137185
2013-01-04  0.793502 -0.820047  1.281136 -0.301450
2013-01-05  0.356899  1.146065  0.417497 -0.115251
2013-01-06  0.648522  0.249195 -1.054314  0.209803

In [8]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df

                   A         B         C         D
2013-01-01  0.377345 -0.361995 -0.435511  0.396943
2013-01-02 -0.326366 -0.722232 -0.006509  0.606142
2013-01-03  1.070022 -0.189074  0.587391 -1.137185
2013-01-04  0.793502 -0.820047  1.281136 -0.301450
2013-01-05  0.356899  1.146065  0.417497 -0.115251
2013-01-06  0.648522  0.249195 -1.054314  0.209803

In [11]:
#DataFrame.iloc[3] takes the 4th line
df.iloc[3]

A    0.793502
B   -0.820047
C    1.281136
D   -0.301450
Name: 2013-01-04 00:00:00, dtype: float64

In [13]:
v1 = df.iloc[3]

In [14]:
type(v1)

pandas.core.series.Series

In [15]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.793502 -0.820047
2013-01-05  0.356899  1.146065

In [16]:
v2 = df.iloc[3:5, 0:2]

In [17]:
type(v2)

pandas.core.frame.DataFrame

In [19]:
v3 = df.iloc[[1, 2, 4], [0, 2]]
v3

                   A         C
2013-01-02 -0.326366 -0.006509
2013-01-03  1.070022  0.587391
2013-01-05  0.356899  0.417497

In [20]:
type(v3)

pandas.core.frame.DataFrame

In [21]:
df

                   A         B         C         D
2013-01-01  0.377345 -0.361995 -0.435511  0.396943
2013-01-02 -0.326366 -0.722232 -0.006509  0.606142
2013-01-03  1.070022 -0.189074  0.587391 -1.137185
2013-01-04  0.793502 -0.820047  1.281136 -0.301450
2013-01-05  0.356899  1.146065  0.417497 -0.115251
2013-01-06  0.648522  0.249195 -1.054314  0.209803

In [22]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.326366 -0.722232 -0.006509  0.606142
2013-01-03  1.070022 -0.189074  0.587391 -1.137185

In [23]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.361995 -0.435511
2013-01-02 -0.722232 -0.006509
2013-01-03 -0.189074  0.587391
2013-01-04 -0.820047  1.281136
2013-01-05  1.146065  0.417497
2013-01-06  0.249195 -1.054314

In [25]:
v4 = df[df.A > 0]
v4

                   A         B         C         D
2013-01-01  0.377345 -0.361995 -0.435511  0.396943
2013-01-03  1.070022 -0.189074  0.587391 -1.137185
2013-01-04  0.793502 -0.820047  1.281136 -0.301450
2013-01-05  0.356899  1.146065  0.417497 -0.115251
2013-01-06  0.648522  0.249195 -1.054314  0.209803

In [26]:
df

                   A         B         C         D
2013-01-01  0.377345 -0.361995 -0.435511  0.396943
2013-01-02 -0.326366 -0.722232 -0.006509  0.606142
2013-01-03  1.070022 -0.189074  0.587391 -1.137185
2013-01-04  0.793502 -0.820047  1.281136 -0.301450
2013-01-05  0.356899  1.146065  0.417497 -0.115251
2013-01-06  0.648522  0.249195 -1.054314  0.209803

In [27]:
np.zeros(5)

array([0., 0., 0., 0., 0.])

In [28]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.377345       NaN       NaN  0.396943
2013-01-02       NaN       NaN       NaN  0.606142
2013-01-03  1.070022       NaN  0.587391       NaN
2013-01-04  0.793502       NaN  1.281136       NaN
2013-01-05  0.356899  1.146065  0.417497       NaN
2013-01-06  0.648522  0.249195       NaN  0.209803

In [29]:
df2 = df.copy()

In [30]:
df2

                   A         B         C         D
2013-01-01  0.377345 -0.361995 -0.435511  0.396943
2013-01-02 -0.326366 -0.722232 -0.006509  0.606142
2013-01-03  1.070022 -0.189074  0.587391 -1.137185
2013-01-04  0.793502 -0.820047  1.281136 -0.301450
2013-01-05  0.356899  1.146065  0.417497 -0.115251
2013-01-06  0.648522  0.249195 -1.054314  0.209803

In [31]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [32]:
df2

                   A         B         C         D      E
2013-01-01  0.377345 -0.361995 -0.435511  0.396943    one
2013-01-02 -0.326366 -0.722232 -0.006509  0.606142    one
2013-01-03  1.070022 -0.189074  0.587391 -1.137185    two
2013-01-04  0.793502 -0.820047  1.281136 -0.301450  three
2013-01-05  0.356899  1.146065  0.417497 -0.115251   four
2013-01-06  0.648522  0.249195 -1.054314  0.209803  three

In [34]:
#Using the isin() method for filtering:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  1.070022 -0.189074  0.587391 -1.137185   two
2013-01-05  0.356899  1.146065  0.417497 -0.115251  four

In [35]:
df2[df2['E'].isin(['one', 'three'])]

                   A         B         C         D      E
2013-01-01  0.377345 -0.361995 -0.435511  0.396943    one
2013-01-02 -0.326366 -0.722232 -0.006509  0.606142    one
2013-01-04  0.793502 -0.820047  1.281136 -0.301450  three
2013-01-06  0.648522  0.249195 -1.054314  0.209803  three

In [37]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [38]:
df['F'] = s1

In [39]:
df

                   A         B         C         D    F
2013-01-01  0.377345 -0.361995 -0.435511  0.396943  NaN
2013-01-02 -0.326366 -0.722232 -0.006509  0.606142  1.0
2013-01-03  1.070022 -0.189074  0.587391 -1.137185  2.0
2013-01-04  0.793502 -0.820047  1.281136 -0.301450  3.0
2013-01-05  0.356899  1.146065  0.417497 -0.115251  4.0
2013-01-06  0.648522  0.249195 -1.054314  0.209803  5.0

In [40]:
df.at[dates[0], 'A'] = 0

In [41]:
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.361995 -0.435511  0.396943  NaN
2013-01-02 -0.326366 -0.722232 -0.006509  0.606142  1.0
2013-01-03  1.070022 -0.189074  0.587391 -1.137185  2.0
2013-01-04  0.793502 -0.820047  1.281136 -0.301450  3.0
2013-01-05  0.356899  1.146065  0.417497 -0.115251  4.0
2013-01-06  0.648522  0.249195 -1.054314  0.209803  5.0

In [42]:
df.at[dates[1], 'D'] = 0

In [43]:
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.361995 -0.435511  0.396943  NaN
2013-01-02 -0.326366 -0.722232 -0.006509  0.000000  1.0
2013-01-03  1.070022 -0.189074  0.587391 -1.137185  2.0
2013-01-04  0.793502 -0.820047  1.281136 -0.301450  3.0
2013-01-05  0.356899  1.146065  0.417497 -0.115251  4.0
2013-01-06  0.648522  0.249195 -1.054314  0.209803  5.0

In [44]:
df.iat[0, 1] = 0

In [45]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.435511  0.396943  NaN
2013-01-02 -0.326366 -0.722232 -0.006509  0.000000  1.0
2013-01-03  1.070022 -0.189074  0.587391 -1.137185  2.0
2013-01-04  0.793502 -0.820047  1.281136 -0.301450  3.0
2013-01-05  0.356899  1.146065  0.417497 -0.115251  4.0
2013-01-06  0.648522  0.249195 -1.054314  0.209803  5.0

In [47]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [48]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.435511  5  NaN
2013-01-02 -0.326366 -0.722232 -0.006509  5  1.0
2013-01-03  1.070022 -0.189074  0.587391  5  2.0
2013-01-04  0.793502 -0.820047  1.281136  5  3.0
2013-01-05  0.356899  1.146065  0.417497  5  4.0
2013-01-06  0.648522  0.249195 -1.054314  5  5.0

In [49]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.435511 -5  NaN
2013-01-02 -0.326366 -0.722232 -0.006509 -5 -1.0
2013-01-03 -1.070022 -0.189074 -0.587391 -5 -2.0
2013-01-04 -0.793502 -0.820047 -1.281136 -5 -3.0
2013-01-05 -0.356899 -1.146065 -0.417497 -5 -4.0
2013-01-06 -0.648522 -0.249195 -1.054314 -5 -5.0

In [50]:
 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.435511  5  NaN  1.0
2013-01-02 -0.326366 -0.722232 -0.006509  5  1.0  1.0
2013-01-03  1.070022 -0.189074  0.587391  5  2.0  NaN
2013-01-04  0.793502 -0.820047  1.281136  5  3.0  NaN

In [53]:
#To drop any rows that have missing data.
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.326366 -0.722232 -0.006509  5  1.0  1.0

In [54]:
#Filling missing data.
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.435511  5  5.0  1.0
2013-01-02 -0.326366 -0.722232 -0.006509  5  1.0  1.0
2013-01-03  1.070022 -0.189074  0.587391  5  2.0  5.0
2013-01-04  0.793502 -0.820047  1.281136  5  3.0  5.0

In [55]:
#To get the boolean mask where values are nan.
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [ ]:
#http://hamelg.blogspot.com/2015/11/python-for-data-analysis-part-19_17.html
#http://hamelg.blogspot.com/2015/11/python-for-data-analysis-part-19_17.html
#http://hamelg.blogspot.com/2015/11/python-for-data-analysis-part-19_17.html

In [ ]:
import numpy as np
import pandas as pd
import os

In [ ]:
os.chdir('C:\\Users\\Greg\\Desktop\\Kaggle\\titanic') # Set working directory

titanic_train = pd.read_csv("titanic_train.csv")      # Read the data

char_cabin = titanic_train["Cabin"].astype(str)    # Convert cabin to str

new_Cabin = np.array([cabin[0] for cabin in char_cabin]) # Take first letter

titanic_train["Cabin"] = pd.Categorical(new_Cabin)  # Save the new cabin var

In [1]:
pwd #present working directory

'C:\\Users\\willi\\Dropbox\\working\\Projects\\190817 ML study group'